# Pandas

Материалы:
* Макрушин С.В. "Лекция 2: Библиотека Pandas"
* https://pandas.pydata.org/docs/user_guide/index.html#
* https://pandas.pydata.org/docs/reference/index.html
* Уэс Маккини. Python и анализ данных

## Задачи для совместного разбора

1. Загрузите данные из файла `sp500hst.txt` и обозначьте столбцы в соответствии с содержимым: `"date", "ticker", "open", "high", "low", "close", "volume"`.

In [6]:
import pandas as pd
data = pd.read_csv("sp500hst.txt",  names=["date", "ticker", "open", "high", "low", "close", "volume"])
data.head()

       date ticker   open     high     low  close  volume
0  20090821      A  25.60  25.6100  25.220  25.55   34758
1  20090824      A  25.64  25.7400  25.330  25.50   22247
2  20090825      A  25.50  25.7000  25.225  25.34   30891
3  20090826      A  25.32  25.6425  25.145  25.48   33334
4  20090827      A  25.50  25.5700  25.230  25.54   70176

2. Рассчитайте среднее значение показателей для каждого из столбцов c номерами 3-6.

In [8]:
data[data.columns[2:6].tolist()].mean()

open     42.595458
high     43.102243
low      42.054464
close    42.601865
dtype: float64

3. Добавьте столбец, содержащий только число месяца, к которому относится дата.

In [10]:
data['month'] = data['date'].astype(str).str[2:4]
data.head()

       date ticker   open     high     low  close  volume month
0  20090821      A  25.60  25.6100  25.220  25.55   34758    09
1  20090824      A  25.64  25.7400  25.330  25.50   22247    09
2  20090825      A  25.50  25.7000  25.225  25.34   30891    09
3  20090826      A  25.32  25.6425  25.145  25.48   33334    09
4  20090827      A  25.50  25.5700  25.230  25.54   70176    09

4. Рассчитайте суммарный объем торгов для для одинаковых значений тикеров.

In [11]:
data.groupby('ticker').sum()['volume']

ticker
A        8609336
AA      81898998
AAPL    52261170
ABC      9006756
ABT     18975870
          ...
XTO     21297931
YHOO    56837171
YUM     10971538
ZION    15551119
ZMH      4938916
Name: volume, Length: 524, dtype: int64

5. Загрузите данные из файла sp500hst.txt и обозначьте столбцы в соответствии с содержимым: "date", "ticker", "open", "high", "low", "close", "volume". Добавьте столбец с расшифровкой названия тикера, используя данные из файла `sp_data2.csv` . В случае нехватки данных об именах тикеров корректно обработать их.

In [12]:
data = pd.read_csv("sp500hst.txt",  names=["date", "ticker", "open", "high", "low", "close", "volume"])
data_2 = pd.read_csv("sp_data2.csv", delimiter=';', names=['ticker', 'transcription', 'percentage'])
shape_0 = data.shape[0]
data = pd.merge(data, data_2, how='left', on='ticker')
if shape_0 == data.shape[0]:
  print('Все тикеры обработаны корректно')
data.head()

Все тикеры обработаны корректно

,date,ticker,open,high,low,close,volume,transcription,percentage
0,20090821,A,25.60,25.6100,25.220,25.55,34758,Agilent Technologies,0.1%
1,20090824,A,25.64,25.7400,25.330,25.50,22247,Agilent Technologies,0.1%
2,20090825,A,25.50,25.7000,25.225,25.34,30891,Agilent Technologies,0.1%
3,20090826,A,25.32,25.6425,25.145,25.48,33334,Agilent Technologies,0.1%
4,20090827,A,25.50,25.5700,25.230,25.54,70176,Agilent Technologies,0.1%

## Лабораторная работа №2

### Базовые операции с `DataFrame`

1.1 В файлах `recipes_sample.csv` и `reviews_sample.csv` находится информация об рецептах блюд и отзывах на эти рецепты соответственно. Загрузите данные из файлов в виде `pd.DataFrame` с названиями `recipes` и `reviews`. Обратите внимание на корректное считывание столбца с индексами в таблице `reviews` (безымянный столбец).

In [15]:
recipes = pd.read_csv("recipes_sample.csv")
recipes.head()

,name,id,minutes,contributor_id,submitted,n_steps,description,n_ingredients
0,george s at the cove black bean soup,44123,90,35193,2002-10-25,NaN,an original recipe created by chef scott meska...,18.0
1,healthy for them yogurt popsicles,67664,10,91970,2003-07-26,NaN,my children and their friends ask for my homem...,NaN
2,i can t believe it s spinach,38798,30,1533,2002-08-29,NaN,"these were so go, it surprised even me.",8.0
3,italian gut busters,35173,45,22724,2002-07-27,NaN,my sister-in-law made these for us at a family...,NaN
4,love is in the air beef fondue sauces,84797,25,4470,2004-02-23,4.0,i think a fondue is a very romantic casual din...,NaN

In [16]:
reviews = pd.read_csv("reviews_sample.csv", index_col=0)
reviews.head()

,user_id,recipe_id,date,rating,review
370476,21752,57993,2003-05-01,5,Last week whole sides of frozen salmon fillet ...
624300,431813,142201,2007-09-16,5,So simple and so tasty! I used a yellow capsi...
187037,400708,252013,2008-01-10,4,"Very nice breakfast HH, easy to make and yummy..."
706134,2001852463,404716,2017-12-11,5,These are a favorite for the holidays and so e...
312179,95810,129396,2008-03-14,5,Excellent soup! The tomato flavor is just gre...

1.2 Для каждой из таблиц выведите основные параметры:
* количество точек данных (строк);
* количество столбцов;
* тип данных каждого столбца.

In [21]:
print('Для таблицы reviews: ')
print(' Количество строк: ', reviews.shape[0])
print(' Количество столбцов: ', reviews.shape[1])
print(' Тип данных каждого столбца: \n', reviews.dtypes)

Для таблицы reviews:
 Количество строк:  126696
 Количество столбцов:  5
 Тип данных каждого столбца:
 user_id       int64
recipe_id     int64
date         object
rating        int64
review       object
dtype: object

In [22]:
print('Для таблицы recipes: ')
print(' Количество строк: ', recipes.shape[0])
print(' Количество столбцов: ', recipes.shape[1])
print(' Тип данных каждого столбца: \n', recipes.dtypes)

Для таблицы recipes:
 Количество строк:  30000
 Количество столбцов:  8
 Тип данных каждого столбца:
 name               object
id                  int64
minutes             int64
contributor_id      int64
submitted          object
n_steps           float64
description        object
n_ingredients     float64
dtype: object

1.3 Исследуйте, в каких столбцах таблиц содержатся пропуски. Посчитайте долю строк, содержащих пропуски, в отношении к общему количеству строк.

In [24]:
print('Доля пропущенных строк (в процентах) в таблице reviews: ')
round(reviews.isna().sum() / reviews.shape[0] * 100, 2)

Доля пропущенных строк (в процентах) в таблице reviews:

user_id      0.00
recipe_id    0.00
date         0.00
rating       0.00
review       0.01
dtype: float64

In [25]:
print('Доля пропущенных строк (в процентах) в таблице recipes: ')
round(recipes.isna().sum() / recipes.shape[0] * 100, 2)

Доля пропущенных строк (в процентах) в таблице recipes:

name               0.00
id                 0.00
minutes            0.00
contributor_id     0.00
submitted          0.00
n_steps           37.30
description        2.08
n_ingredients     29.60
dtype: float64

1.4 Рассчитайте среднее значение для каждого из числовых столбцов (где это имеет смысл).

In [27]:
import numpy as np

num_columns = recipes.select_dtypes(include=np.number).columns
num_columns = [i for i in num_columns if 'id' not in i]
recipes[num_columns].mean()

minutes          123.358133
n_steps            9.805582
n_ingredients      9.008286
dtype: float64

In [28]:
num_columns = reviews.select_dtypes(include=np.number).columns
num_columns = [i for i in num_columns if 'id' not in i]
reviews[num_columns].mean()

rating    4.410802
dtype: float64

1.5 Создайте серию из 10 случайных названий рецептов.

In [29]:
recipes['name'].sample(n=10)

9700                       dutch baby   adapted
4334                  cabbage zucchini stir fry
21007                       plum sponge pudding
13034                 grilled stuffed plantains
2370                         basic cheese pizza
24498    slow cooker mediterranean roast turkey
7827                           crab rockefeller
14794         jack fry s key lime pie ice cream
1797                    baked chicken with beer
4665                 caramel praline cheesecake
Name: name, dtype: object

1.6 Измените индекс в таблице `reviews`, пронумеровав строки, начиная с нуля.

In [30]:
reviews.index = np.arange(0, reviews.shape[0])
reviews.head()

,user_id,recipe_id,date,rating,review
0,21752,57993,2003-05-01,5,Last week whole sides of frozen salmon fillet ...
1,431813,142201,2007-09-16,5,So simple and so tasty! I used a yellow capsi...
2,400708,252013,2008-01-10,4,"Very nice breakfast HH, easy to make and yummy..."
3,2001852463,404716,2017-12-11,5,These are a favorite for the holidays and so e...
4,95810,129396,2008-03-14,5,Excellent soup! The tomato flavor is just gre...

1.7 Выведите информацию о рецептах, время выполнения которых не больше 20 минут и кол-во ингредиентов в которых не больше 5.

In [31]:
recipes[(recipes.minutes <= 20) & (recipes.n_ingredients <= 5)].head()

,name,id,minutes,contributor_id,submitted,n_steps,description,n_ingredients
28,quick biscuit bread,302399,20,213909,2008-05-06,11.0,this is a wonderful quick bread to make as an ...,5.0
60,peas fit for a king or queen,303944,20,213909,2008-05-16,NaN,this recipe is so simple and the flavors are s...,5.0
90,hawaiian sunrise mimosa,100837,5,58104,2004-09-29,4.0,pineapple mimosa was changed to hawaiian sunri...,3.0
91,tasty dish s banana pudding in 2 minutes,286484,2,47892,2008-02-13,NaN,"""mmmm, i love bananas!"" a --tasty dish-- origi...",4.0
94,1 minute meatballs,11361,13,4470,2001-09-03,NaN,this is a real short cut for cooks in a hurry....,2.0

### Работа с датами в `pandas`

2.1 Преобразуйте столбец `submitted` из таблицы `recipes` в формат времени. Модифицируйте решение задачи 1.1 так, чтобы считать столбец сразу в нужном формате.

In [35]:
recipes['submitted']

0        2002-10-25
1        2003-07-26
2        2002-08-29
3        2002-07-27
4        2004-02-23
            ...
29995    2007-11-25
29996    2009-08-24
29997    2004-11-03
29998    2012-08-29
29999    2008-04-15
Name: submitted, Length: 30000, dtype: object

In [36]:
recipes['submitted'] =  pd.to_datetime(recipes['submitted'], format='%Y-%M-%d').dt.date
recipes['submitted'].head()

0    2002-01-25
1    2003-01-26
2    2002-01-29
3    2002-01-27
4    2004-01-23
Name: submitted, dtype: object

2.2 Выведите информацию о рецептах, добавленных в датасет не позже 2010 года.

In [37]:
recipes[recipes['submitted'] <= pd.Timestamp(2010,12,31)].head()

C:\Users\USER\anaconda3\lib\site-packages\pandas\core\ops\array_ops.py:73: FutureWarning: Comparison of Timestamp with datetime.date is deprecated in order to match the standard library behavior. In a future version these will be considered non-comparable. Use 'ts == pd.Timestamp(date)' or 'ts.date() == date' instead.
  result = libops.scalar_compare(x.ravel(), y, op)

,name,id,minutes,contributor_id,submitted,n_steps,description,n_ingredients
0,george s at the cove black bean soup,44123,90,35193,2002-01-25,NaN,an original recipe created by chef scott meska...,18.0
1,healthy for them yogurt popsicles,67664,10,91970,2003-01-26,NaN,my children and their friends ask for my homem...,NaN
2,i can t believe it s spinach,38798,30,1533,2002-01-29,NaN,"these were so go, it surprised even me.",8.0
3,italian gut busters,35173,45,22724,2002-01-27,NaN,my sister-in-law made these for us at a family...,NaN
4,love is in the air beef fondue sauces,84797,25,4470,2004-01-23,4.0,i think a fondue is a very romantic casual din...,NaN

### Работа со строковыми данными в `pandas`

3.1  Добавьте в таблицу `recipes` столбец `description_length`, в котором хранится длина описания рецепта из столбца `description`.

In [38]:
recipes['description_length'] = recipes['description'].astype(str).apply(len)
recipes.head()

,name,id,minutes,contributor_id,submitted,n_steps,description,n_ingredients,description_length
0,george s at the cove black bean soup,44123,90,35193,2002-01-25,NaN,an original recipe created by chef scott meska...,18.0,330
1,healthy for them yogurt popsicles,67664,10,91970,2003-01-26,NaN,my children and their friends ask for my homem...,NaN,255
2,i can t believe it s spinach,38798,30,1533,2002-01-29,NaN,"these were so go, it surprised even me.",8.0,39
3,italian gut busters,35173,45,22724,2002-01-27,NaN,my sister-in-law made these for us at a family...,NaN,154
4,love is in the air beef fondue sauces,84797,25,4470,2004-01-23,4.0,i think a fondue is a very romantic casual din...,NaN,587

3.2 Измените название каждого рецепта в таблице `recipes` таким образом, чтобы каждое слово в названии начиналось с прописной буквы.

In [39]:
recipes['name'] = recipes['name'].str.lower()
recipes.head()

,name,id,minutes,contributor_id,submitted,n_steps,description,n_ingredients,description_length
0,george s at the cove black bean soup,44123,90,35193,2002-01-25,NaN,an original recipe created by chef scott meska...,18.0,330
1,healthy for them yogurt popsicles,67664,10,91970,2003-01-26,NaN,my children and their friends ask for my homem...,NaN,255
2,i can t believe it s spinach,38798,30,1533,2002-01-29,NaN,"these were so go, it surprised even me.",8.0,39
3,italian gut busters,35173,45,22724,2002-01-27,NaN,my sister-in-law made these for us at a family...,NaN,154
4,love is in the air beef fondue sauces,84797,25,4470,2004-01-23,4.0,i think a fondue is a very romantic casual din...,NaN,587

3.3 Добавьте в таблицу `recipes` столбец `name_word_count`, в котором хранится количество слов из названии рецепта (считайте, что слова в названии разделяются только пробелами). Обратите внимание, что между словами может располагаться несколько пробелов подряд.

In [40]:
recipes['name_word_count'] = recipes['name'].apply(lambda x: len(str(x).split(' ')))
recipes.head()

,name,id,minutes,contributor_id,submitted,n_steps,description,n_ingredients,description_length,name_word_count
0,george s at the cove black bean soup,44123,90,35193,2002-01-25,NaN,an original recipe created by chef scott meska...,18.0,330,9
1,healthy for them yogurt popsicles,67664,10,91970,2003-01-26,NaN,my children and their friends ask for my homem...,NaN,255,6
2,i can t believe it s spinach,38798,30,1533,2002-01-29,NaN,"these were so go, it surprised even me.",8.0,39,7
3,italian gut busters,35173,45,22724,2002-01-27,NaN,my sister-in-law made these for us at a family...,NaN,154,4
4,love is in the air beef fondue sauces,84797,25,4470,2004-01-23,4.0,i think a fondue is a very romantic casual din...,NaN,587,11

### Группировки таблиц `pd.DataFrame`

4.1 Посчитайте количество рецептов, представленных каждым из участников (`contributor_id`). Какой участник добавил максимальное кол-во рецептов?

In [42]:
recipes_counter = reviews.groupby('user_id').count()['recipe_id'].sort_values(ascending=False)
print(recipes_counter.head())

print(f'\n\n\nТоп 1: \n{recipes_counter.head(1)}')

user_id
424680    848
37449     602
383346    489
169430    444
128473    431
Name: recipe_id, dtype: int64



Топ 1:
user_id
424680    848
Name: recipe_id, dtype: int64

4.2 Посчитайте средний рейтинг к каждому из рецептов. Для скольких рецептов отсутствуют отзывы? Обратите внимание, что отзыв с нулевым рейтингом или не заполненным текстовым описанием не считается отсутствующим.

In [47]:
reviews.groupby('recipe_id').mean()['rating']

recipe_id
48        1.000000
55        4.750000
66        4.944444
91        4.750000
94        5.000000
            ...
536547    5.000000
536610    0.000000
536728    4.000000
536729    4.750000
536747    0.000000
Name: rating, Length: 28100, dtype: float64

In [48]:
print(len(set(recipes.id.to_list()) - set(reviews.recipe_id.to_list())))

1900

4.3 Посчитайте количество рецептов с разбивкой по годам создания.

In [50]:
reviews['year'] = reviews['date'].astype(str).apply(lambda x: x[:4])
reviews.head()

,user_id,recipe_id,date,rating,review,year
0,21752,57993,2003-05-01,5,Last week whole sides of frozen salmon fillet ...,2003
1,431813,142201,2007-09-16,5,So simple and so tasty! I used a yellow capsi...,2007
2,400708,252013,2008-01-10,4,"Very nice breakfast HH, easy to make and yummy...",2008
3,2001852463,404716,2017-12-11,5,These are a favorite for the holidays and so e...,2017
4,95810,129396,2008-03-14,5,Excellent soup! The tomato flavor is just gre...,2008

In [51]:
reviews.groupby('year').count()['recipe_id']

year
2000       13
2001      305
2002     2494
2003     3879
2004     5070
2005     7577
2006     9964
2007    15634
2008    18614
2009    17672
2010    12094
2011     8118
2012     6095
2013     5679
2014     3445
2015     2715
2016     2071
2017     2926
2018     2331
Name: recipe_id, dtype: int64

### Объединение таблиц `pd.DataFrame`

5.1 При помощи объединения таблиц, создайте `DataFrame`, состоящий из четырех столбцов: `id`, `name`, `user_id`, `rating`. Рецепты, на которые не оставлен ни один отзыв, должны отсутствовать в полученной таблице. Подтвердите правильность работы вашего кода, выбрав рецепт, не имеющий отзывов, и попытавшись найти строку, соответствующую этому рецепту, в полученном `DataFrame`.

In [53]:
df_5_1 = recipes.merge(reviews, left_on='id', right_on='recipe_id', how='inner')[['id', 'name', 'user_id', 'rating']]
df_5_1.head()

      id                                   name  user_id  rating
0  44123  george s at the cove  black bean soup   743566       5
1  44123  george s at the cove  black bean soup    76503       5
2  44123  george s at the cove  black bean soup    34206       5
3  67664     healthy for them  yogurt popsicles   494084       5
4  67664     healthy for them  yogurt popsicles   303445       5

In [55]:
res_set = set(recipes.id.to_list()) - set(reviews.recipe_id.to_list())
recipe = list(res_set)[np.random.randint(0, len(res_set))]

if df_5_1[df_5_1.id == recipe].shape[0] == 0:
  print('Done :)')
else:
  print('Fail :(')

Done :)

5.2 При помощи объединения таблиц и группировок, создайте `DataFrame`, состоящий из трех столбцов: `recipe_id`, `name`, `review_count`, где столбец `review_count` содержит кол-во отзывов, оставленных на рецепт `recipe_id`. У рецептов, на которые не оставлен ни один отзыв, в столбце `review_count` должен быть указан 0. Подтвердите правильность работы вашего кода, выбрав рецепт, не имеющий отзывов, и найдя строку, соответствующую этому рецепту, в полученном `DataFrame`.

In [56]:
reviews_count_df = reviews.groupby('recipe_id', as_index=False).count()[['recipe_id', 'review']]
reviews_count_df.rename(columns={'review': 'review_count'}, inplace=True)
reviews_count_df = reviews_count_df.astype({"recipe_id": "Int64", "review_count": "Int64"})

res_df = reviews_count_df.merge(recipes, left_on='recipe_id', right_on='id', how='right')[['id', 'name', 'review_count']]
res_df.head()

      id                                      name  review_count
0  44123     george s at the cove  black bean soup             3
1  67664        healthy for them  yogurt popsicles             8
2  38798              i can t believe it s spinach             3
3  35173                      italian  gut busters             1
4  84797  love is in the air  beef fondue   sauces             8

5.3. Выясните, рецепты, добавленные в каком году, имеют наименьший средний рейтинг?

In [58]:
recipes['year_submitted'] = recipes['submitted'].astype(str).apply(lambda x: x[:4])
recipes.head()

,name,id,minutes,contributor_id,submitted,n_steps,description,n_ingredients,description_length,name_word_count,year_submitted
0,george s at the cove black bean soup,44123,90,35193,2002-01-25,NaN,an original recipe created by chef scott meska...,18.0,330,9,2002
1,healthy for them yogurt popsicles,67664,10,91970,2003-01-26,NaN,my children and their friends ask for my homem...,NaN,255,6,2003
2,i can t believe it s spinach,38798,30,1533,2002-01-29,NaN,"these were so go, it surprised even me.",8.0,39,7,2002
3,italian gut busters,35173,45,22724,2002-01-27,NaN,my sister-in-law made these for us at a family...,NaN,154,4,2002
4,love is in the air beef fondue sauces,84797,25,4470,2004-01-23,4.0,i think a fondue is a very romantic casual din...,NaN,587,11,2004

In [60]:
new_df = recipes.merge(reviews, how='inner', left_on='id', right_on='recipe_id')[['id', 'rating', 'year_submitted']]
new_df.head()

      id  rating year_submitted
0  44123       5           2002
1  44123       5           2002
2  44123       5           2002
3  67664       5           2003
4  67664       5           2003

In [61]:
new_df.groupby('year_submitted').mean()['rating']

year_submitted
1999    4.274895
2000    4.284585
2001    4.393945
2002    4.404645
2003    4.439152
2004    4.463778
2005    4.409687
2006    4.416310
2007    4.420073
2008    4.387416
2009    4.360447
2010    4.406279
2011    4.375850
2012    4.412736
2013    4.336508
2014    4.538235
2015    4.207317
2016    3.538462
2017    2.750000
2018    3.388889
Name: rating, dtype: float64

### Сохранение таблиц `pd.DataFrame`

6.1 Отсортируйте таблицу в порядке убывания величины столбца `name_word_count` и сохраните результаты выполнения заданий 3.1-3.3 в csv файл.

In [63]:
res_recipes_df = recipes.sort_values('name_word_count', ascending=False)
res_recipes_df.head()

,name,id,minutes,contributor_id,submitted,n_steps,description,n_ingredients,description_length,name_word_count,year_submitted
3323,blue cheese meatloaf ...,402871,75,144140,2009-01-08,3.0,o.k...all of you blue cheese lovers out there....,NaN,310,31,2009
2676,beef stroganoff betty webb,332495,40,892963,2008-01-23,NaN,tenderized beef round steak is cut into thin s...,12.0,428,21,2008
14401,if give a kid a candy they always come back...,289263,45,488441,2008-01-29,7.0,my neighbor annie is a fantastic fake out cook...,NaN,413,18,2008
15225,kathy 4 ma po s bean curd w pork zwt ii ...,173440,15,296809,2006-01-17,9.0,my sister again & this time with what she desc...,13.0,270,18,2006
17223,meal in a bowl noodle soup for 1 double fo...,25190,11,5060,2002-01-14,4.0,this sounded very good from the local newspape...,NaN,71,17,2002

In [64]:
res_recipes_df.to_csv('res_recipes.csv', sep='\t')

6.2 Воспользовавшись `pd.ExcelWriter`, cохраните результаты 5.1 и 5.2 в файл: на лист с названием `Рецепты с оценками` сохраните результаты выполнения 5.1; на лист с названием `Количество отзывов по рецептам` сохраните результаты выполнения 5.2.

In [65]:
with pd.ExcelWriter('lr_2.xlsx') as writer:
    df_5_1.to_excel(writer, sheet_name='Рецепты с оценками')
    res_df.to_excel(writer, sheet_name='Количество отзывов по рецептам')

#### [версия 2]
* Уточнены формулировки задач 1.1, 3.3, 4.2, 5.1, 5.2, 5.3